[
  {
    "Date": "2025-11-20",
    "Title": "Proof of Concept",
    "Version Number": "Alpha 1.0",
    "Changes": "Proof of concept stage to process E-Reports into actionable data.\n\nFunctions:\n- Process Transmille E Report into json format\n- Allow for instant searching between E-status jobs\n- Assign jobs live to individual engineers\n- Export Engineers 'assigned' lists to excel reports.\n- Set active engineers daily\n- Settings for colours, engineers, turnaround threshold."
  },
  {
    "Date": "2025-11-21",
    "Title": "Concept Functionality Complete",
    "Version Number": "Alpha 2.0.0",
    "Changes": "This update brings many changes, additions and improvements.\n\nBug Fixes:\n- Starting a new day no longer deletes the database file.\n- Priorities and Assignments are no longer deleted after a new day start.\n- Clicking \"Show List\" no longer opens a second widget on the screen with two lists. Now operates as \"Refresh List\".\n\nChanges:\n- New day now operates as an import with active engineer selection and a complete backup of the database.\n- Print Icon updated to a more appropriate icon.\n- Project moved to private Git to avoid file corruption for security.\n- Data import handling changed to move 'new data' to a temporary file to allow for comparison between old and new data to obtain analytics data.\n\nAdditions/Improvements:\n- Bottom options bar now includes \"Sub\" button, assigning selected jobs to a \"Sub\" 'engineer' for report exporting. Previously had to scroll down engineer list.\n- Import Report button was given proper functionality, allowing database to be updated from a new E-Report (Removing old jobs and adding new ones) without having to reset the entire database.\n- Analytics added (Rudimentary and improper, based on the transition from E to any other status based on data provided.\n- Show Status now shows telemetry data obtained from updates with tabs for different functions. This is mostly to show what is possible when auto-data-input comes into play, data currently presented should not be trusted as fact (Indication Only).\n- Change Log added.\n- Improved process for data handling to decrease process speed.\n- Added \"Current Instruments\" counter in bottom corner.\n- Added \"Active Engineers\" to Menu > Edit to allow easier, more dynamic changes to current active staff.\n\n\nTargets for future:\n- More diverse colour coding thresholds to allow for Age Tiers.\n- Priority Levels in Urgent Status.\n- Easy access to \"Live\" information showing instruments at different stages. Will operate as an extention to the Current Instruments counter.\n- Confirm multi-user support. May require small traffic handler to stop background updates during processes.\n- Live updating from files to further support multi-user. Currently users would have to use the \"Refresh List\" button to re-pull data from dataset.\n- Themes. Python has limited ability to modernize GUIs due to tkinter and it's addons being outdated. Working on colour schemes could make it look less... Windows 7.\n- Move Sub & Priority exports to their own processes instead of using fake \"Engineers\" to bypass the issue.\n\nNotes:\nGraphs and data visualisations are imported functions from previous projects not intended for this setup. \"Show Status\" should be considered very proof of concept."
  },
  {
    "Date": "2025-11-21",
    "Title": "Minor Update: Button Title",
    "Version Number": "Alpha 2.0.1",
    "Changes": "Changes:\n- Changed \"Show Status\" to \"Analytics\""
  },
  {
    "Date": "2025-11-23",
    "Title": "ODIN Package",
    "Version Number": "Alpha 2.1.0",
    "Changes": "Alpha 2.1.0 brings a rebranding to ODIN, coupled with the \"ODIN - Engineer\" application.\n\n### ODIN ###\nChanges:\n- More robust about information and window titles which are now pulled from settings.\n- Instead of slow-loading, app now runs immediately and presents a loading screen while data is imported.\n- LOGO!!!\n- Filetype changed to .pyw to force open as a GUI application. This removes the Windows Commandline needing to be open in the background.\n\nBug Fixes:\n- Show List was duplicating the list on the screen, now operates as refresh again. This was fixed in a previous version but the issue re-presented itself.\n- Settings was replaced with an \"Instant Change\" system. Previous versions had a \"Save Changes\" button which was removing things outside of it's internal 'template' as the settings file was completely rewritten everytime. Individual values are now changed instead.\n\n### ODIN - Engineer ###\nVersion: 1.0.0\nODIN - Engineer is an application designed for the individual engineer to use to see their assigned jobs without requiring a printed sheet.\n\nIt also allows an engineer to mark jobs as \"Complete\" quickly and easily. This allows a lab manager to more quickly see progress without the need to 'chase' progress reports. These jobs would be removed from an E-Report import in ODIN as well.\n\nCompleted jobs are colour-coded Green so that the engineer can easily see what they have completed.\n\nODIN - Engineer is made from a more filtered tree function taken from ODIN, meaning they run on the same collaborative system.\n\n### Current Objectives ###\nObjective: Create a 'session' system to assign active sessions to each open application on each computer.\nGain: Objectives can send activity reports which can trigger refreshes on other applications, removing the need for manual refreshing while decreasing a 'constant update' system.\nChallenges: The current list refresh function destroys the current list and creates a new one. This results in a 'flicker' and selection reset. This could be irritating for the end-user if they are actively working in the application particularly from a management perspective.\n\nObjective: Incorporate N/F/L status imports\nGain: Much more accurate analytics. Easier explanation of current events in morning meetings.\nChallenges: Due to the manual nature of Transmille reporting, this adds more work from a management perspective that makes the function more hassle than it may be worth.\n\nObjective: Compiled EXEs, Installer, Auto-Updates\nGain: More user-friendly, quicker/easier install process, no python installation required. Applications can then send a version number request to GitHub to check for updates and alert users to updates and smooth that process.\n\nObjective: Move from tkinter to customtkinter\nGain: This is where the application can start looking like an actual application. Customertkinter allows us to completely change the appearance and make it look more professional and purpose-built.\nChallenges: customertkinter presented a problem during testing with menubars, meaning File/Edit/Utilities/About would have to be manually written instead of borrowing from tkinter's prexisting system. Due to python and tkinter forming GUIs on a pack or grid system, it's impossible to \"Overlap\" properly so you can't build a proper drop-down-from-button system like the pre-existing menubar.\n\nObjective: Themes for light/dark mode\nGain: Makes the current tkinter setup easier on the eyes.\nChallenges: Buttons and dropboxes don't like changing colour. More research is required for this.\n\nSide-note, this was an exceptionally fun update to build."
  }
]